# 1. Создать строку равную третьему символу введенной строки.

string_1 = 'Greetins!'
print(string_1[2])
