# 2. Создать строку равную предпоследнему символу введенной строки.

string_1 = 'Greetins!'
print(string_1[-2])
