#4. Создать строку равную введенной строку без последних двух символов.

string_1 = 'Greetings!'
print(string_1[:-2])
