# 3. Создать строку равную первым пяти символам введенной строки.

string_1 = 'Greetins!'
print(string_1[0:5])
