'''Создать список поездов. Структура словаря: номер поезда,
пункт и время прибытия, пункт и время отбытия. Вывести все сведения о поездах,
время пребывания в пути которых превышает 7 часов 20 минут'''
import datetime
slov = {'perv': 2021}
print(datetime.date(1,2,3))
