"""Создать строку равную первым пяти символам введенной строки."""

your_str = input()
part_str = your_str[0:5]
print(part_str)
