"""Создать строку равную предпоследнему символу введенной строки."""

your_str = input()
last_symbol = your_str[-2]
print(last_symbol)
