"""Создать строку равную третьему символу введенной строки."""

example_str = input()
third_symbol = example_str[3]
print(third_symbol)
