"""Ввести строку с клавиатуры.
1.Создать строку равную третьему символу введенной строки."""
my_string = input("Введите строку: ")
my_string2 = my_string[2]
print(my_string2)