"""
Создать строку равную первым пяти символам введенной строки
"""
my_strinng = input("Введите строку: ")
string_result = my_strinng[:5]
print(string_result)