"""
Создать строку равную введенной строку без последних двух символов
"""
my_string = input("Введите строку: ")
string_result = my_string[:-2]
print(string_result)