""" Задание:
Написать 12 функций по переводу:
1.Дюймы в сантиметры
2.Сантиметры в дюймы
3.Мили в километры
4.Километры в мили
5.Фунты в килограммы
6.Килограммы в фунты
7.Унции в граммы
8.Граммы в унции
9.Галлон в литры
10.Литры в галлоны
11.Пинты в литры
12.Литры в пинты
Примечание:функция принимает навход число и возвращает конвертированное число
"""


def func1(x):  # Дюймы в сантиметры
    return x * 2.54


def func2(x):  # Сантиметры в дюймы
    return x / 2.54


def func3(x):  # Мили в километры
    return x * 1.61


def func4(x):  # Километры в мили
    return x / 1.61


def func5(x):  # Фунты в килограммы
    return x * 0.4535


def func6(x):  # Килограммы в фунты
    return x / 0.4535


def func7(x):  # Унции в граммы
    return x * 28.35


def func8(x):  # Граммы в унции
    return x / 28.35


def func9(x):  # Галлон в литры
    return x * 4.546


def func10(x):  # Литры в галлоны
    return x / 4.546


def func11(x):  # Пинты в литры
    return x * 0.5683


def func12(x):  # Литры в пинты
    return x / 0.5683


